request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://localhost:8081/ws">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:obtenerPaisRequest>
            <gs:name>argentina</gs:name>
        </gs:obtenerPaisRequest>
    </soapenv:Body>
</soapenv:Envelope>